TrainCase/case1/0/I2_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
-1.37014e-19
-3.45273e-24
-1.0009e-14
-3.04828e-24
-3.29069e-11
-2.5597e-16
-6.24083e-16
-1.85061e-19
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-6.99233e-16
-1.2128e-23
-7.42029e-16
2.88337e-25
-5.44166e-16
-4.68656e-24
-4.40121e-16
-1.03669e-24
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-3.89033e-46
2.59826e-45
-2.68097e-42
1.02425e-40
-6.15401e-39
1.32355e-37
-1.87021e-36
2.34214e-35
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-2.33406e-11
1.85457e-07
-3.84824e-05
0.000126421
-0.00307868
0.000603755
-0.0134379
0.000674054
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-2.60641e-17
2.57944e-17
-2.63271e-17
2.64749e-17
-2.70297e-17
2.72965e-17
-2.77508e-17
2.80224e-17
...
)
;
    }
}


// ************************************************************************* //
