TrainCase/case1/0/Mg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Mg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
3.46477e-07
1.59676e-06
9.07628e-07
1.48268e-06
5.3146e-06
2.10414e-06
1.39833e-06
4.91022e-06
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1.4417e-06
1.59552e-06
1.48156e-06
1.39732e-06
1.33599e-06
1.28661e-06
1.2449e-06
1.20989e-06
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.69612e-10
1.97788e-10
5.09007e-10
9.33774e-10
1.77674e-09
2.89175e-09
4.52726e-09
6.82718e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.19614e-05
6.24743e-05
0.000345553
0.00125577
0.00332924
0.00681249
0.0102002
0.0129209
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
8.0418e-06
8.05523e-06
8.07579e-06
8.09504e-06
8.11701e-06
8.13727e-06
8.15954e-06
8.17888e-06
...
)
;
    }
}


// ************************************************************************* //
