TrainCase/case1/0/Sp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Sp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<symmTensor> 
31383
(
(-5236.71 1.1876e+06 0 9291.32 0 -4054.61)
(-1.75234 5.19308e+06 0 3.73146 0 -1.97912)
(-5248.67 1.27052e+06 0 9240.32 0 -3991.65)
(-4.36689 5.00698e+06 0 7.16262 0 -2.79573)
(0.350675 5.19883e+06 0 0.559691 0 -0.910365)
(-5188.61 1.26104e+06 0 9138.08 0 -3949.47)
(-1.72192 4.8637e+06 0 2.18487 0 -0.462951)
(-6.99648 5.01228e+06 0 9.2544 0 -2.25792)
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
317
(
(-5251.72 4.94365e+06 0 9321.34 0 -4069.62)
(-6.94335 5.1905e+06 0 14.1135 0 -7.17013)
(-4.23647 5.00458e+06 0 6.90179 0 -2.66531)
(-1.42162 4.86145e+06 0 1.58428 0 -0.162656)
(-4.23544 4.75403e+06 0 7.43564 0 -3.2002)
(-6.57065 4.66596e+06 0 12.2294 0 -5.65877)
(-5.0867 4.59055e+06 0 9.35203 0 -4.26533)
(-2.41172 4.52608e+06 0 4.08295 0 -1.67123)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(0.0120568 0.00912458 -1.18769e-16 -0.0241135 4.1393e-22 0.0120568)
(0.0128935 0.014405 -2.64994e-16 -0.0257871 -1.37289e-21 0.0128935)
(0.0201471 0.0459919 5.3477e-16 -0.0575878 3.0942e-21 0.0374408)
(0.0361396 0.0829253 -8.17195e-22 -0.106866 2.03236e-21 0.0707267)
(0.0599529 0.170234 -3.49417e-16 -0.189081 -4.84693e-21 0.129128)
(0.0827884 0.277306 2.08153e-16 -0.303927 7.72539e-21 0.221139)
(0.135718 0.432662 -2.19674e-21 -0.47896 4.7046e-21 0.343241)
(0.191657 0.659066 -2.55301e-16 -0.711895 -1.47975e-20 0.520238)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(-1.61434e+06 5.43975e+06 0 3.22868e+06 0 -1.61434e+06)
(-1.54556e+06 5.20804e+06 0 3.09112e+06 0 -1.54556e+06)
(-6.22387e+06 1.76825e+06 2.15609e-11 4.67035e+06 9.59881e-12 1.55352e+06)
(-1.50901e+06 5.08141e+06 -4.87218e-11 3.01801e+06 -2.16926e-11 -1.50901e+06)
(-5.68464e+06 1.93298e+06 2.69477e-11 4.39599e+06 1.19988e-11 1.28865e+06)
(-1.31341e+06 4.41899e+06 0 2.62683e+06 0 -1.31341e+06)
(-4.20079e+06 1.87379e+06 -3.40858e-15 3.43081e+06 -1.52058e-15 769985)
(-926810 3.12205e+06 0 1.85362e+06 0 -926810)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
317
(
(375.296 635.297 3.29671e-15 -998.977 -6.83258e-16 623.681)
(378.361 633.064 0 -1003.59 0 625.227)
(378.629 635.433 2.90838e-15 -1005.46 8.54259e-17 626.828)
(380.699 635.695 -2.63046e-15 -1009 -8.15605e-16 628.305)
(381.19 638.153 -2.85844e-12 -1011.09 -1.00858e-13 629.902)
(382.689 638.849 2.82958e-12 -1014.39 9.77486e-14 631.705)
(383.887 640.808 0 -1017.03 0 633.144)
(385.331 641.607 -5.3532e-15 -1020.08 -1.56914e-16 634.751)
...
)
;
    }
}


// ************************************************************************* //
