TrainCase/case1/0/lambda2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
-1.03102e-06
-1.95303e-05
-4.31005e-05
-1.81239e-05
-0.000640903
-0.000359723
-1.70914e-05
-0.000595561
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-1.77516e-05
-1.95111e-05
-1.81066e-05
-1.70756e-05
-1.63283e-05
-1.5725e-05
-1.52132e-05
-1.47849e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-5.71042e-16
-9.42768e-17
-1.74934e-16
-9.09682e-16
-3.18273e-16
-3.41773e-15
-1.62984e-14
-3.41453e-14
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.000476433
-0.0136368
-0.0647539
-0.160745
-0.28812
-0.377531
-0.456661
-0.451814
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-2.97698e-08
-2.69795e-08
-2.83553e-08
-2.786e-08
-2.91677e-08
-2.92078e-08
-3.00321e-08
-3.00203e-08
...
)
;
    }
}


// ************************************************************************* //
