TrainCase/case1/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
5.72953e-05
5.73894e-05
5.71245e-05
5.74508e-05
5.72453e-05
5.69271e-05
5.74763e-05
5.73123e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
5.73744e-05
5.74473e-05
5.75069e-05
5.75308e-05
5.75382e-05
5.75499e-05
5.75677e-05
5.75786e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 8.42583e-06;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.2946e-05
1.37526e-05
1.40721e-05
1.40476e-05
1.50561e-05
1.37286e-05
1.516e-05
1.32105e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 8.42583e-06;
    }
}


// ************************************************************************* //
