TrainCase/case1/0/q3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      q3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.000155633
0.000163986
0.000189275
0.000157926
0.000281462
0.000252607
0.000153327
0.00026971
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
3.10837e-13
3.27641e-13
3.15544e-13
3.06364e-13
2.99534e-13
2.93907e-13
2.89053e-13
2.84927e-13
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 2;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.963948
0.814095
1.71255
2
2
2
2
2
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 2;
    }
}


// ************************************************************************* //
