TrainCase/case1/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.301925
0.301479
0.30243
0.301161
0.301904
0.303017
0.301032
0.301569
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
0.301692
0.301309
0.300997
0.300872
0.300833
0.300772
0.300679
0.300622
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.821243;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.33792
1.2933
1.2767
1.27794
1.22893
1.29456
1.22416
1.32284
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.821243;
    }
}


// ************************************************************************* //
